# ShowTitle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ShowTitle Property
ScheduleDefinition Class See Also
---
Indicates if the title will be displayed in the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public bool ShowTitle { get; set; }
```

Visual Basic
---
```text
Public Property ShowTitle As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowTitle {
	bool get ();
	void set (bool value);
}
```

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace